function b_form(sSelector){

	var f = this;

	// 1. Секция данных (свойства)==============================================================================================================================================
	f.selector = sSelector
	f.form = $(f.selector);

	// 2. Секция логики ==============================================================================================================================================
	f.showInfo = function(){
		alert(
			'Ваша форма:'
			+ '\nВаше имя: '			+ f.form.find('.b-form__name').val()
			
		
		
			);
		}
	f.getLanguages = function (){}
	f.val = function (){}
	f.label = function (){}
	
	// 3. Секция событий =============================================================================================================================================

	// при щелчке по кнопке OK - показать информацию
	f.form.find('.b-form__ok-button').click('f.showInfo');

	}